//	Программа Graph_Dijkstra
//
//	Программа предназначена для ввыполнения следующей задачи:
//
//	Пользователь задает ориентированный граф, каждому ребру приписывается стоимость пути
//	между вершинами. Вычислить минимальную стоимость пути из заданной вершины во все
//	остальные. Алгоритм Дейкстры.
//
//	Текущий файл source.c содержит тела связанных с графом функций, необходимых для решения данной задачи.
//
//	Автор: Степаненко Кирилл
//	Группа: ИВТ-13БО
//
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include "mygraphlib.h"

void main() {
	int * costList;		//Указатель на массив, содержащий стоимость пути до всех вершин из данной вершины.
	int ** adjMatrix;	//Указатель на матрицу смежности ориентированного взвешенного графа.

	//Блок ввода матрицы (скорее всего через консоль)
	//Блаблабла


}