//	Программа All_Divisors_Of_Natural_Number
//
//	Программа преназначена для выполнения следующего задания:
//
//		При нахождении делителей натурального числа количество проверок возможных делителей
//		можно существенно сократить, если учесть, что у каждого делителя d числа n, не
//		превышающего квадратный корень из n, есть “симметричный” ему делитель. 
//		Например, если n = 30, достаточно найти делители 1, 2, 3, 5 
//		(целая часть квадратного корня из 30 равна 5), а все прочие вычисляются.
//		Напишите программу, в которой все делители заданного числа n будут выводиться в порядке
//		возрастания(без дополнительной сортировки, но с использование стеков).
//
//		Текущий файл Source.c содержит в себе основную функцию main и включение всех необходимых файлов.
//		
//	Автор: Степаненко Кирилл
//	Группа: ИВТ-13БО
//